{
  "basics": {
    "name": "Ruicheng Yang",
    "label": "M.S. Student in Computational Social Science",
    "image": "",
    "email": "yangrc8@gmail.com",
    "phone": "+1 (858) 241-7929",
    "url": "https://richardyang8.github.io",
    "summary": "A Master's student in Computational Social Science at UC San Diego, with a background in Sociology from Anhui University. Passionate about applying computational methods, machine learning, and statistical analysis to social science research.",
    "location": {
      "city": "San Diego",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "richardyang8",
        "url": "https://github.com/richardyang8"
      }
    ]
  },
  "work": [
    {
      "name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
      "position": "Research Intern (Remote)",
      "startDate": "2024-08-01",
      "endDate": "2024-09-30",
      "summary": "Conducted research on land use changes and urban ecological degradation.",
      "highlights": [
        "Analyzed land use changes in 3 regions over 4 decades using ArcGIS software",
        "Accessed extensive literature from Web of Science, ScienceDirect, Google Scholar",
        "Analyzed indicators related to urban ecological degradation",
        "Engaged in assessing potential impacts of urban ecosystem policies"
      ]
    },
    {
      "name": "Jianghuai Tribune, Anhui Academy of Social Sciences",
      "position": "Editorial Intern",
      "location": "Anhui, China",
      "startDate": "2023-07-01",
      "endDate": "2023-08-31",
      "summary": "Supported academic journal publication and rural revitalization research.",
      "highlights": [
        "Developed rural revitalization investigation",
        "Edited and proofread 20+ academic journal articles",
        "Attended manuscript revision seminars as conference secretary"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of California, San Diego",
      "area": "Computational Social Science",
      "studyType": "Master of Science",
      "startDate": "2025-09-01",
      "endDate": "2026-06-30",
      "score": "",
      "courses": [
        "Statistical Methods for Computational Social Science",
        "Statistical Computing and Inference from Data",
        "Machine Learning for Social Sciences",
        "Large Language Models",
        "Neural Networks/Deep Learning"
      ]
    },
    {
      "institution": "Anhui University",
      "area": "Sociology",
      "studyType": "Bachelor of Law",
      "startDate": "2021-09-01",
      "endDate": "2025-06-30",
      "score": "GPA: 3.91/5.0 (WES: 3.67/4.0)",
      "courses": [
        "Social Research Methods",
        "Social Statistics",
        "Social Governance",
        "Theories of Foreign Sociology",
        "Quantitative Research Design",
        "Statistics Software"
      ]
    }
  ],
  "awards": [
    {
      "title": "Academic Achievement Scholarship",
      "date": "2024-01-01",
      "awarder": "Anhui University",
      "summary": ""
    },
    {
      "title": "Arts and Sports Scholarship",
      "date": "2023-01-01",
      "awarder": "Anhui University",
      "summary": ""
    }
  ],
  "publications": [
    {
      "name": "Education and Environment-Friendly Behavior: The Mediating Role of Environmental Concern",
      "publisher": "Journal of Education, Humanities and Social Sciences",
      "releaseDate": "2024-01-01",
      "url": "",
      "summary": "Accepted by ETEMSS 2024, published in conference proceedings (ISSN: 2771-2907)"
    },
    {
      "name": "The Influence of National Rural Construction Policies on Development Path of Landscaping Companies",
      "publisher": "International Conference on Interdisciplinary Humanities and Communication Studies (ICIHCS 2022)",
      "releaseDate": "2022-01-01",
      "url": "",
      "summary": "Co-authored with Qianzhong S. and Jingyu Z. (DOI: 10.54254/2753-7048/6/20220950)"
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "Intermediate",
      "keywords": ["Python", "R", "Stata", "SPSS"]
    },
    {
      "name": "Software & Tools",
      "level": "Proficient",
      "keywords": ["Microsoft Office Suite", "ArcGIS", "Endnote", "Zotero"]
    },
    {
      "name": "Research Methods",
      "level": "Proficient",
      "keywords": ["Statistical Analysis", "Quantitative Research", "Machine Learning"]
    }
  ],
  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "projects": [
    {
      "name": "Neural Data Decomposition for Hidden Population Discovery",
      "summary": "Capstone Project at UCSD — Director: Dr. Meenakshi Khosla",
      "startDate": "2025-09-01",
      "endDate": "2026-06-30",
      "highlights": [
        "Developing a Python-based computational pipeline to demix high-dimensional neural signals using matrix factorization",
        "Utilizing GPU clusters to perform dimensionality reduction and factor analysis of brain data",
        "Evaluating component stability through cross-validation and interpreting functional significance"
      ]
    },
    {
      "name": "Embracing Community: Urban Public Cultural Space Construction and Governance",
      "summary": "National-level Project — National College Students' Innovative Entrepreneurial Training Plan Program",
      "startDate": "2024-04-01",
      "endDate": "",
      "highlights": [
        "Explored governance mechanism of urban public space with theories of urban gentrification and spatial politics",
        "Conducted field research collecting 200+ valid responses from community residents and social workers",
        "Analyzed effectiveness of existing policies and proposed recommendations for optimizing urban public space governance"
      ]
    },
    {
      "name": "Sociological Research and Quantitative Analysis Methods in a Global Context",
      "summary": "Online Course Experience — Instructor: Prof. Parfait from Cornell University",
      "startDate": "2024-01-01",
      "endDate": "2024-04-30",
      "highlights": [
        "Traced the shifts in developmental theory from early optimism to recent pessimism",
        "Undertook quantitative and qualitative studies of global evolution, population growth, social equity",
        "Extracted data from CGSS2021 (2,735 samples) for quantitative and qualitative analyses",
        "Independently authored article on Education and Environment-Friendly Behavior"
      ]
    },
    {
      "name": "Gender Preferences, Family Support and Fertility Intention Studies",
      "summary": "Course Project for Statistics Software — Empirical Evidence from CFPS",
      "startDate": "2023-03-01",
      "endDate": "2023-06-30",
      "highlights": [
        "Filtered sample size of 3,404 men and women aged 22-44 from CFPS2018",
        "Built OLS and Poisson regression models for data analysis",
        "Contributed paper on impact of gender preferences and family support on fertility intentions"
      ]
    },
    {
      "name": "Enhancement of Young Married Women's Fertility Intentions Based on Youth-Friendly Cities",
      "summary": "Provincial-level Project (No.S202310357540) — National College Students' Innovative Entrepreneurial Training Plan Program",
      "startDate": "2023-02-01",
      "endDate": "2024-05-31",
      "highlights": [
        "Reviewed 40+ literature to define youth-friendly city construction framework",
        "Designed fertility intention questionnaire and distributed to 117 young married women",
        "Used SPSS to analyze data revealing low satisfaction with fertility support policies",
        "Proposed 9 policy optimization paths, affirmed by Anhui Women's Federation"
      ]
    },
    {
      "name": "Rural Tourism Digital Transformation under the Integration of Culture and Tourism",
      "summary": "Group Leader — 2022 Anhui Rural Revitalization Innovation and Entrepreneurship Competition",
      "startDate": "2022-11-01",
      "endDate": "2022-12-31",
      "highlights": [
        "Accessed policies on culture empowerment for rural revitalization",
        "Conducted social surveys and field visits on local attitudes toward cultural integration",
        "Analyzed rural digital tourism feasibility and designed logo endorsed by village council"
      ]
    },
    {
      "name": "Rural Social Policy and Economic Change",
      "summary": "Remote Research Project — Instructor: Prof. Xu from Fudan University",
      "startDate": "2022-07-01",
      "endDate": "2022-08-31",
      "highlights": [
        "Applied theoretical framework of rural sociology to evaluate township division's economic behavior",
        "Carried out case studies grounded on 10+ literature reviews",
        "Co-authored paper on National Rural Construction Policies and Landscaping Companies"
      ]
    }
  ]
}
